#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyzw        0     NONE   float       
; NORMAL                   0   xyz         1     NONE   float       
; TEXCOORD                 0   xy          2     NONE   float       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 3f41f27a14d35d1756c01ac51abe4bd4.lld
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                 linear       
; NORMAL                   0                 linear       
; TEXCOORD                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer MaterialCB
; {
;
;   struct MaterialCB
;   {
;
;       struct struct.Material
;       {
;
;           float4 Emissive;                          ; Offset:    0

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !24, globals: !108)
!1 = !DIFile(filename: "Shaders\5CShaders\5CHDR_ps.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !21)
!6 = !{!7, !9, !17}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !5, file: !1, baseType: !8, size: 32, align: 32)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$03@@QBAAAMI@Z", scope: !5, file: !1, type: !10, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !14, !16}
!12 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !13)
!13 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!16 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!17 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$03@@QAAAAMI@Z", scope: !5, file: !1, type: !18, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!18 = !DISubroutineType(types: !19)
!19 = !{!12, !20, !16}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!21 = !{!22, !23}
!22 = !DITemplateTypeParameter(name: "element", type: !13)
!23 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!24 = !{!25, !64, !71, !82, !85, !88, !91, !105}
!25 = !DISubprogram(name: "main", scope: !26, file: !26, line: 175, type: !27, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!26 = !DIFile(filename: "Shaders\5CHDR_ps.hlsl", directory: "")
!27 = !DISubroutineType(types: !28)
!28 = !{!4, !29}
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "PixelShaderInput", file: !26, line: 1, size: 288, align: 32, elements: !30)
!30 = !{!31, !32, !48}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "PositionVS", scope: !29, file: !26, line: 3, baseType: !4, size: 128, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "NormalVS", scope: !29, file: !26, line: 4, baseType: !33, size: 96, align: 32, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !35, templateParams: !46)
!35 = !{!36, !37, !42}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !34, file: !1, baseType: !8, size: 32, align: 32)
!37 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$02@@QBAAAMI@Z", scope: !34, file: !1, type: !38, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!38 = !DISubroutineType(types: !39)
!39 = !{!12, !40, !16}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!42 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$02@@QAAAAMI@Z", scope: !34, file: !1, type: !43, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!43 = !DISubroutineType(types: !44)
!44 = !{!12, !45, !16}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!46 = !{!22, !47}
!47 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !29, file: !26, line: 5, baseType: !49, size: 64, align: 32, offset: 224)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !50)
!50 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !51, templateParams: !62)
!51 = !{!52, !53, !58}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !50, file: !1, baseType: !8, size: 32, align: 32)
!53 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$01@@QBAAAMI@Z", scope: !50, file: !1, type: !54, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!54 = !DISubroutineType(types: !55)
!55 = !{!12, !56, !16}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!58 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$01@@QAAAAMI@Z", scope: !50, file: !1, type: !59, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!59 = !DISubroutineType(types: !60)
!60 = !{!12, !61, !16}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!62 = !{!22, !63}
!63 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!64 = !DISubprogram(name: "DoLighting", linkageName: "\01?DoLighting@@YA?AULightResult@@V?$vector@M$02@@0@Z", scope: !26, file: !26, line: 147, type: !65, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false)
!65 = !DISubroutineType(types: !66)
!66 = !{!67, !33, !33}
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "LightResult", file: !26, line: 65, size: 256, align: 32, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !67, file: !26, line: 67, baseType: !4, size: 128, align: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !67, file: !26, line: 68, baseType: !4, size: 128, align: 32, offset: 128)
!71 = !DISubprogram(name: "DoPointLight", linkageName: "\01?DoPointLight@@YA?AULightResult@@UPointLight@@V?$vector@M$02@@11@Z", scope: !26, file: !26, line: 115, type: !72, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: false)
!72 = !DISubroutineType(types: !73)
!73 = !{!67, !74, !33, !33, !33}
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "PointLight", file: !26, line: 24, size: 512, align: 32, elements: !75)
!75 = !{!76, !77, !78, !79, !80, !81}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !74, file: !26, line: 26, baseType: !4, size: 128, align: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "PositionVS", scope: !74, file: !26, line: 28, baseType: !4, size: 128, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !74, file: !26, line: 30, baseType: !4, size: 128, align: 32, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Intensity", scope: !74, file: !26, line: 32, baseType: !13, size: 32, align: 32, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Attenuation", scope: !74, file: !26, line: 33, baseType: !13, size: 32, align: 32, offset: 416)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Padding", scope: !74, file: !26, line: 34, baseType: !49, size: 64, align: 32, offset: 448)
!82 = !DISubprogram(name: "DoAttenuation", linkageName: "\01?DoAttenuation@@YAMMM@Z", scope: !26, file: !26, line: 102, type: !83, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false)
!83 = !DISubroutineType(types: !84)
!84 = !{!13, !13, !13}
!85 = !DISubprogram(name: "DoDiffuse", linkageName: "\01?DoDiffuse@@YAMV?$vector@M$02@@0@Z", scope: !26, file: !26, line: 89, type: !86, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false)
!86 = !DISubroutineType(types: !87)
!87 = !{!13, !33, !33}
!88 = !DISubprogram(name: "DoSpecular", linkageName: "\01?DoSpecular@@YAMV?$vector@M$02@@00@Z", scope: !26, file: !26, line: 94, type: !89, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false)
!89 = !DISubroutineType(types: !90)
!90 = !{!13, !33, !33, !33}
!91 = !DISubprogram(name: "DoSpotLight", linkageName: "\01?DoSpotLight@@YA?AULightResult@@USpotLight@@V?$vector@M$02@@11@Z", scope: !26, file: !26, line: 130, type: !92, isLocal: false, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: false)
!92 = !DISubroutineType(types: !93)
!93 = !{!67, !94, !33, !33, !33}
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpotLight", file: !26, line: 39, size: 768, align: 32, elements: !95)
!95 = !{!96, !97, !98, !99, !100, !101, !102, !103, !104}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !94, file: !26, line: 41, baseType: !4, size: 128, align: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "PositionVS", scope: !94, file: !26, line: 43, baseType: !4, size: 128, align: 32, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "DirectionWS", scope: !94, file: !26, line: 45, baseType: !4, size: 128, align: 32, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "DirectionVS", scope: !94, file: !26, line: 47, baseType: !4, size: 128, align: 32, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !94, file: !26, line: 49, baseType: !4, size: 128, align: 32, offset: 512)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Intensity", scope: !94, file: !26, line: 51, baseType: !13, size: 32, align: 32, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "SpotAngle", scope: !94, file: !26, line: 52, baseType: !13, size: 32, align: 32, offset: 672)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Attenuation", scope: !94, file: !26, line: 53, baseType: !13, size: 32, align: 32, offset: 704)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Padding", scope: !94, file: !26, line: 54, baseType: !13, size: 32, align: 32, offset: 736)
!105 = !DISubprogram(name: "DoSpotCone", linkageName: "\01?DoSpotCone@@YAMV?$vector@M$02@@0M@Z", scope: !26, file: !26, line: 107, type: !106, isLocal: false, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: false)
!106 = !DISubroutineType(types: !107)
!107 = !{!13, !33, !33, !13}
!108 = !{!109, !115, !121, !138}
!109 = !DIGlobalVariable(name: "PointLights", linkageName: "\01?PointLights@@3V?$StructuredBuffer@UPointLight@@@@A", scope: !0, file: !26, line: 74, type: !110, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<PointLight>"* @"\01?PointLights@@3V?$StructuredBuffer@UPointLight@@@@A")
!110 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<PointLight>", file: !1, line: 74, size: 512, align: 32, elements: !111, templateParams: !113)
!111 = !{!112}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !110, file: !1, line: 74, baseType: !74, size: 512, align: 32)
!113 = !{!114}
!114 = !DITemplateTypeParameter(name: "element", type: !74)
!115 = !DIGlobalVariable(name: "SpotLights", linkageName: "\01?SpotLights@@3V?$StructuredBuffer@USpotLight@@@@A", scope: !0, file: !26, line: 75, type: !116, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<SpotLight>"* @"\01?SpotLights@@3V?$StructuredBuffer@USpotLight@@@@A")
!116 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<SpotLight>", file: !1, line: 75, size: 768, align: 32, elements: !117, templateParams: !119)
!117 = !{!118}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !116, file: !1, line: 75, baseType: !94, size: 768, align: 32)
!119 = !{!120}
!120 = !DITemplateTypeParameter(name: "element", type: !94)
!121 = !DIGlobalVariable(name: "DiffuseTexture", linkageName: "\01?DiffuseTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !26, line: 76, type: !122, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?DiffuseTexture@@3V?$Texture2D@V?$vector@M$03@@@@A")
!122 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 76, size: 160, align: 32, elements: !123, templateParams: !136)
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !122, file: !1, line: 76, baseType: !5, size: 128, align: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "mips", scope: !122, file: !1, line: 76, baseType: !126, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!126 = !DICompositeType(tag: DW_TAG_class_type, name: "mips_type", scope: !122, file: !1, line: 76, size: 32, align: 32, elements: !127)
!127 = !{!128, !129}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !126, file: !1, line: 76, baseType: !16, size: 32, align: 32)
!129 = !DISubprogram(name: "operator[]", linkageName: "\01??Amips_type@?$Texture2D@V?$vector@M$03@@@@QBA$$QAVmips_slice_type@1@I@Z", scope: !126, file: !1, line: 76, type: !130, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!130 = !DISubroutineType(types: !131)
!131 = !{!132, !134, !16}
!132 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !133)
!133 = !DICompositeType(tag: DW_TAG_class_type, name: "mips_slice_type", scope: !122, file: !1, line: 76, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!136 = !{!137}
!137 = !DITemplateTypeParameter(name: "element", type: !5)
!138 = !DIGlobalVariable(name: "LinearRepeatSampler", linkageName: "\01?LinearRepeatSampler@@3USamplerState@@A", scope: !0, file: !26, line: 78, type: !139, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?LinearRepeatSampler@@3USamplerState@@A")
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 78, size: 32, align: 32, elements: !140)
!140 = !{!141}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !139, file: !1, line: 78, baseType: !8, size: 32, align: 32, flags: DIFlagPrivate)
!142 = !{i32 2, !"Dwarf Version", i32 4}
!143 = !{i32 2, !"Debug Info Version", i32 3}
!144 = !{!"dxc 1.2"}
