#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyzw        0     NONE   float       
; NORMAL                   0   xyz         1     NONE   float       
; TEXCOORD                 0   xy          2     NONE   float       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: cb5bf9cbfc41de866c99bc969003fae5.lld
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                 linear       
; NORMAL                   0                 linear       
; TEXCOORD                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !63)
!1 = !DIFile(filename: "Shaders\5CShaders\5CSprite_ps.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DISubprogram(name: "main", scope: !5, file: !5, line: 80, type: !6, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!5 = !DIFile(filename: "Shaders\5CSprite_ps.hlsl", directory: "")
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !28}
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !9)
!9 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !10, templateParams: !25)
!10 = !{!11, !13, !21}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !9, file: !1, baseType: !12, size: 32, align: 32)
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$03@@QBAAAMI@Z", scope: !9, file: !1, type: !14, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!14 = !DISubroutineType(types: !15)
!15 = !{!16, !18, !20}
!16 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !17)
!17 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!20 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!21 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$03@@QAAAAMI@Z", scope: !9, file: !1, type: !22, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!22 = !DISubroutineType(types: !23)
!23 = !{!16, !24, !20}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!25 = !{!26, !27}
!26 = !DITemplateTypeParameter(name: "element", type: !17)
!27 = !DITemplateValueParameter(name: "element_count", type: !12, value: i32 4)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "PixelShaderInput", file: !5, line: 1, size: 288, align: 32, elements: !29)
!29 = !{!30, !31, !47}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "PositionVS", scope: !28, file: !5, line: 3, baseType: !8, size: 128, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "NormalVS", scope: !28, file: !5, line: 4, baseType: !32, size: 96, align: 32, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !34, templateParams: !45)
!34 = !{!35, !36, !41}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !33, file: !1, baseType: !12, size: 32, align: 32)
!36 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$02@@QBAAAMI@Z", scope: !33, file: !1, type: !37, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!37 = !DISubroutineType(types: !38)
!38 = !{!16, !39, !20}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!41 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$02@@QAAAAMI@Z", scope: !33, file: !1, type: !42, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!42 = !DISubroutineType(types: !43)
!43 = !{!16, !44, !20}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!45 = !{!26, !46}
!46 = !DITemplateValueParameter(name: "element_count", type: !12, value: i32 3)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !28, file: !5, line: 5, baseType: !48, size: 64, align: 32, offset: 224)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !50, templateParams: !61)
!50 = !{!51, !52, !57}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !49, file: !1, baseType: !12, size: 32, align: 32)
!52 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$01@@QBAAAMI@Z", scope: !49, file: !1, type: !53, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!53 = !DISubroutineType(types: !54)
!54 = !{!16, !55, !20}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!57 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$01@@QAAAAMI@Z", scope: !49, file: !1, type: !58, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!58 = !DISubroutineType(types: !59)
!59 = !{!16, !60, !20}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!61 = !{!26, !62}
!62 = !DITemplateValueParameter(name: "element_count", type: !12, value: i32 2)
!63 = !{!64, !78, !95, !112}
!64 = !DIGlobalVariable(name: "PointLights", linkageName: "\01?PointLights@@3V?$StructuredBuffer@UPointLight@@@@A", scope: !0, file: !5, line: 74, type: !65, isLocal: false, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<PointLight>", file: !1, line: 74, size: 512, align: 32, elements: !66, templateParams: !76)
!66 = !{!67}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !65, file: !1, line: 74, baseType: !68, size: 512, align: 32)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "PointLight", file: !5, line: 24, size: 512, align: 32, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !68, file: !5, line: 26, baseType: !8, size: 128, align: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "PositionVS", scope: !68, file: !5, line: 28, baseType: !8, size: 128, align: 32, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !68, file: !5, line: 30, baseType: !8, size: 128, align: 32, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Intensity", scope: !68, file: !5, line: 32, baseType: !17, size: 32, align: 32, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Attenuation", scope: !68, file: !5, line: 33, baseType: !17, size: 32, align: 32, offset: 416)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Padding", scope: !68, file: !5, line: 34, baseType: !48, size: 64, align: 32, offset: 448)
!76 = !{!77}
!77 = !DITemplateTypeParameter(name: "element", type: !68)
!78 = !DIGlobalVariable(name: "SpotLights", linkageName: "\01?SpotLights@@3V?$StructuredBuffer@USpotLight@@@@A", scope: !0, file: !5, line: 75, type: !79, isLocal: false, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<SpotLight>", file: !1, line: 75, size: 768, align: 32, elements: !80, templateParams: !93)
!80 = !{!81}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !79, file: !1, line: 75, baseType: !82, size: 768, align: 32)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpotLight", file: !5, line: 39, size: 768, align: 32, elements: !83)
!83 = !{!84, !85, !86, !87, !88, !89, !90, !91, !92}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !82, file: !5, line: 41, baseType: !8, size: 128, align: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "PositionVS", scope: !82, file: !5, line: 43, baseType: !8, size: 128, align: 32, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "DirectionWS", scope: !82, file: !5, line: 45, baseType: !8, size: 128, align: 32, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "DirectionVS", scope: !82, file: !5, line: 47, baseType: !8, size: 128, align: 32, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !82, file: !5, line: 49, baseType: !8, size: 128, align: 32, offset: 512)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Intensity", scope: !82, file: !5, line: 51, baseType: !17, size: 32, align: 32, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "SpotAngle", scope: !82, file: !5, line: 52, baseType: !17, size: 32, align: 32, offset: 672)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Attenuation", scope: !82, file: !5, line: 53, baseType: !17, size: 32, align: 32, offset: 704)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Padding", scope: !82, file: !5, line: 54, baseType: !17, size: 32, align: 32, offset: 736)
!93 = !{!94}
!94 = !DITemplateTypeParameter(name: "element", type: !82)
!95 = !DIGlobalVariable(name: "DiffuseTexture", linkageName: "\01?DiffuseTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !5, line: 76, type: !96, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?DiffuseTexture@@3V?$Texture2D@V?$vector@M$03@@@@A")
!96 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 76, size: 160, align: 32, elements: !97, templateParams: !110)
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !96, file: !1, line: 76, baseType: !9, size: 128, align: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "mips", scope: !96, file: !1, line: 76, baseType: !100, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!100 = !DICompositeType(tag: DW_TAG_class_type, name: "mips_type", scope: !96, file: !1, line: 76, size: 32, align: 32, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !100, file: !1, line: 76, baseType: !20, size: 32, align: 32)
!103 = !DISubprogram(name: "operator[]", linkageName: "\01??Amips_type@?$Texture2D@V?$vector@M$03@@@@QBA$$QAVmips_slice_type@1@I@Z", scope: !100, file: !1, line: 76, type: !104, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!104 = !DISubroutineType(types: !105)
!105 = !{!106, !108, !20}
!106 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !107)
!107 = !DICompositeType(tag: DW_TAG_class_type, name: "mips_slice_type", scope: !96, file: !1, line: 76, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!110 = !{!111}
!111 = !DITemplateTypeParameter(name: "element", type: !9)
!112 = !DIGlobalVariable(name: "LinearRepeatSampler", linkageName: "\01?LinearRepeatSampler@@3USamplerState@@A", scope: !0, file: !5, line: 78, type: !113, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?LinearRepeatSampler@@3USamplerState@@A")
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 78, size: 32, align: 32, elements: !114)
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !113, file: !1, line: 78, baseType: !12, size: 32, align: 32, flags: DIFlagPrivate)
!116 = !{i32 2, !"Dwarf Version", i32 4}
!117 = !{i32 2, !"Debug Info Version", i32 3}
!118 = !{!"dxc 1.2"}
